---
title: SweptBlend
classe: Autodesk.Revit.DB.SweptBlend
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GenericForm
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# SweptBlend

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `CurveArrArray BottomProfile { get; }` | `sweptBlend.BottomProfile` | CurveArrArray |
| `FamilySymbolProfile BottomProfileSymbol { get; }` | `sweptBlend.BottomProfileSymbol` | FamilySymbolProfile |
| `Sketch BottomSketch { get; }` | `sweptBlend.BottomSketch` | Sketch |
| `Sketch PathSketch { get; }` | `sweptBlend.PathSketch` | Sketch |
| `Curve SelectedPath { get; }` | `sweptBlend.SelectedPath` | Curve |
| `CurveArrArray TopProfile { get; }` | `sweptBlend.TopProfile` | CurveArrArray |
| `FamilySymbolProfile TopProfileSymbol { get; }` | `sweptBlend.TopProfileSymbol` | FamilySymbolProfile |
| `Sketch TopSketch { get; }` | `sweptBlend.TopSketch` | Sketch |
| `VertexIndexPairArray GetVertexConnectionMap()` | `sweptBlend.GetVertexConnectionMap()` | VertexIndexPairArray |
| `Void SetVertexConnectionMap(VertexIndexPairArray)` | `sweptBlend.SetVertexConnectionMap(vertexMap)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```